
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Если Не ЗначениеЗаполнено(Объект.Ссылка) и не ЗначениеЗаполнено(Параметры.Основание)
	//	и Не ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
	//	
	//	Объект.Склад = ХранилищеОбщихНастроек.Загрузить("ОсновнойСклад");		
	//
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СложныйСлучай1(Команда)
	
	А = 1;
	
	Если Модифицированность или Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("А", А);
	
		ПоказатьВопрос(Новый ОписаниеОповещения("СложныйСлучай1Завершение", ЭтотОбъект , ДополнительныеПараметры), "Предварительно документ необходимо сохранить. Сохранить документ?", РежимДиалогаВопрос.ДаНет);
        Возврат;
		
	КонецЕсли;
	
	СложныйСлучай1Фрагмент(А);
КонецПроцедуры

&НаКлиенте
Процедура СложныйСлучай1Завершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса =
		КодВозвратаДиалога.Да Тогда
		ДокументЗаписан = Записать();
	Иначе
		ДокументЗаписан = Ложь;
	КонецЕсли;	
	
	Если Не ДокументЗаписан Тогда
		Возврат;
	КонецЕсли;
	
	
	СложныйСлучай1Фрагмент(ДополнительныеПараметры.А);

КонецПроцедуры

&НаКлиенте
Процедура СложныйСлучай1Фрагмент(А)
	
	А = А+1;
	Сообщить("Программный код после условия");
	
КонецПроцедуры

&НаКлиенте
Процедура СложныйСлучай2_Команда1(Команда)
	
	А = 1;
	ДополнительныеПараметры = Новый Структура("А", А);
	
	Оповещение = Новый ОписаниеОповещения("СложныйСлучай2_Команда1Продолжение", ЭтотОбъект , ДополнительныеПараметры);
	СохранитьДокументИВыполнитьКод(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура СложныйСлучай2_Команда1Продолжение(Результат, ДополнительныеПараметры) Экспорт

	А = ДополнительныеПараметры.А;
	А = А + 1;
	
	Сообщить("Программный код - команда 1");
	
КонецПроцедуры // СложныйСлучай2_Команда1Продолжение()

&НаКлиенте
Процедура СложныйСлучай2_Команда2(Команда)
	
	Оповещение = Новый ОписаниеОповещения("СложныйСлучай2_Команда2Продолжение", ЭтотОбъект);
	СохранитьДокументИВыполнитьКод(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура СложныйСлучай2_Команда2Продолжение(Результат, ДополнительныеПараметры) Экспорт

	Сообщить("Программный код - команда 2");
	
КонецПроцедуры // СложныйСлучай2_Команда2Продолжение()

&НаКлиенте
Процедура СохранитьДокументИВыполнитьКод(Оповещение)

	Если Модифицированность или Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ПоказатьВопрос(Новый ОписаниеОповещения("СохранитьДокументИВыполнитьКодЗавершение", ЭтотОбъект, Оповещение),
					   "Предварительно документ необходимо сохранить. Сохранить документ?",
					   РежимДиалогаВопрос.ДаНет);
		
	Иначе
		ВыполнитьОбработкуОповещения(Оповещение);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СохранитьДокументИВыполнитьКодЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да и Записать() Тогда
	
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры);	
	
	КонецЕсли;	
	
КонецПроцедуры
 // СохранитьДокументИВыполнитьКод()






























